MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M451VE6AE/mcu.h
#define DAC_CTL_TRGSEL_Pos               (5)                                               /*!< DAC_T::CTL: TRGSEL Position               */
#define DAC_CTL_TRGSEL_Msk               (0x7ul << DAC_CTL_TRGSEL_Pos)                     /*!< DAC_T::CTL: TRGSEL Mask                   */

#define DAC_CTL_BYPASS_Pos               (8)                                               /*!< DAC_T::CTL: BYPASS Position               */
#define DAC_CTL_BYPASS_Msk               (0x1ul << DAC_CTL_BYPASS_Pos)                     /*!< DAC_T::CTL: BYPASS Mask                   */

#define DAC_CTL_LALIGN_Pos               (10)                                              /*!< DAC_T::CTL: LALIGN Position               */
#define DAC_CTL_LALIGN_Msk               (0x1ul << DAC_CTL_LALIGN_Pos)                     /*!< DAC_T::CTL: LALIGN Mask                   */

#define DAC_CTL_ETRGSEL_Pos              (12)                                              /*!< DAC_T::CTL: ETRGSEL Position              */
#define DAC_CTL_ETRGSEL_Msk              (0x3ul << DAC_CTL_ETRGSEL_Pos)                    /*!< DAC_T::CTL: ETRGSEL Mask                  */

#define DAC_SWTRG_SWTRG_Pos              (0)                                               /*!< DAC_T::SWTRG: SWTRG Position              */
#define DAC_SWTRG_SWTRG_Msk              (0x1ul << DAC_SWTRG_SWTRG_Pos)                    /*!< DAC_T::SWTRG: SWTRG Mask                  */

#define DAC_DAT_DAC_DAT_Pos              (0)                                               /*!< DAC_T::DAT: DAC_DAT Position              */
#define DAC_DAT_DAC_DAT_Msk              (0xfffful << DAC_DAT_DAC_DAT_Pos)                 /*!< DAC_T::DAT: DAC_DAT Mask                  */

#define DAC_DATOUT_DATOUT_Pos            (0)                                               /*!< DAC_T::DATOUT: DATOUT Position            */
#define DAC_DATOUT_DATOUT_Msk            (0xffful << DAC_DATOUT_DATOUT_Pos)                /*!< DAC_T::DATOUT: DATOUT Mask                */

#define DAC_STATUS_FINISH_Pos            (0)                                               /*!< DAC_T::STATUS: FINISH Position            */
#define DAC_STATUS_FINISH_Msk            (0x1ul << DAC_STATUS_FINISH_Pos)                  /*!< DAC_T::STATUS: FINISH Mask                */

#define DAC_STATUS_DMAUDR_Pos            (1)                                               /*!< DAC_T::STATUS: DMAUDR Position            */
#define DAC_STATUS_DMAUDR_Msk            (0x1ul << DAC_STATUS_DMAUDR_Pos)                  /*!< DAC_T::STATUS: DMAUDR Mask                */

#define DAC_STATUS_BUSY_Pos              (8)                                               /*!< DAC_T::STATUS: BUSY Position              */
#define DAC_STATUS_BUSY_Msk              (0x1ul << DAC_STATUS_BUSY_Pos)                    /*!< DAC_T::STATUS: BUSY Mask                  */

#define DAC_TCTL_SETTLET_Pos             (0)                                               /*!< DAC_T::TCTL: SETTLET Position             */
#define DAC_TCTL_SETTLET_Msk             (0x3fful << DAC_TCTL_SETTLET_Pos)                 /*!< DAC_T::TCTL: SETTLET Mask                 */

/**@}*/ /* DAC_CONST */
/**@}*/ /* end of DAC register group */


/*---------------------- External Bus Interface Controller -------------------------*/
/**
    @addtogroup EBI External Bus Interface Controller(EBI)
    Memory Mapped Structure for EBI Controller
@{ */


typedef struct
{




/**
 * @var EBI_T::CTL0
 * Offset: 0x00  External Bus Interface Bank0 Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |EN        |EBI Enable Bit
 * |        |          |This bit is the functional enable bit for EBI.
 * |        |          |0 = EBI function Disabled.
 * |        |          |1 = EBI function Enabled.
 * |[1]     |DW16      |EBI Data Width 16-Bit Select
 * |        |          |This bit defines if the EBI data width is 8-bit or 16-bit.
 * |        |          |0 = EBI data width is 8-bit.
 * |        |          |1 = EBI data width is 16-bit.
 * |[2]     |CSPOLINV  |Chip Select Pin Polar Inverse
 * |        |          |This bit defines the active level of EBI chip select pin (EBI_nCS).
 * |        |          |0 = Chip select pin (EBI_nCS) is active low.
 * |        |          |1 = Chip select pin (EBI_nCS) is active high.
 * |[10:8]  |MCLKDIV   |External Output Clock Divider
 * |        |          |The frequency of EBI output clock (MCLK) is controlled by MCLKDIV as follow:
 * |        |          |000 = HCLK/1.
 * |        |          |001 = HCLK/2.
 * |        |          |010 = HCLK/4.
 * |        |          |011 = HCLK/8.
 * |        |          |100 = HCLK/16.
 * |        |          |101 = HCLK/32.
 * |        |          |110 = Reserved.
 * |        |          |111 = Reserved.
 * |[18:16] |TALE      |Extend Time Of ALE
 * |        |          |The EBI_ALE high pulse period (tALE) to latch the address can be controlled by TALE.
 * |        |          |tALE = (TALE+1)*EBI_MCLK.
 * |        |          |Note: This field only available in EBI_CTL0 register
 * |[24]    |WBUFEN    |EBI Write Buffer Enable Bit
 * |        |          |0 = EBI write buffer Disabled.
 * |        |          |1 = EBI write buffer Enabled.
 * |        |          |Note: This bit only available in EBI_CTL0 register
 * @var EBI_T::TCTL0
 * Offset: 0x04  External Bus Interface Bank0 Timing Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:3]   |TACC      |EBI Data Access Time
 * |        |          |TACC define data access time (tACC).
 * |        |          |tACC = (TACC +1) * EBI_MCLK.
 * |[10:8]  |TAHD      |EBI Data Access Hold Time
 * |        |          |TAHD define data access hold time (tAHD).
 * |        |          |tAHD = (TAHD +1) * EBI_MCLK.
 * |[15:12] |W2X       |Idle Cycle After Write
 * |        |          |This field defines the number of W2X idle cycle.
 * |        |          |W2X idle cycle = (W2X * EBI_MCLK).
 * |        |          |When write action is finish, W2X idle cycle is inserted and EBI_nCS return to idle state.
 * |[22]    |RAHDOFF   |Access Hold Time Disable Control When Read
 * |        |          |0 = The Data Access Hold Time (tAHD) during EBI reading is Enabled.
 * |        |          |1 = The Data Access Hold Time (tAHD) during EBI reading is Disabled.
 * |[23]    |WAHDOFF   |Access Hold Time Disable Control When Write
 * |        |          |0 = The Data Access Hold Time (tAHD) during EBI writing is Enabled.
 * |        |          |1 = The Data Access Hold Time (tAHD) during EBI writing is Disabled.
 * |[27:24] |R2R       |Idle Cycle Between Read-To-Read
 * |        |          |This field defines the number of R2R idle cycle.
 * |        |          |R2R idle cycle = (R2R * EBI_MCLK).
 * |        |          |When read action is finish and next action is going to read, R2R idle cycle is inserted and EBI_nCS return to idle state.
 * @var EBI_T::CTL1
 * Offset: 0x10  External Bus Interface Bank1 Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |EN        |EBI Enable Bit
 * |        |          |This bit is the functional enable bit for EBI.
 * |        |          |0 = EBI function Disabled.
 * |        |          |1 = EBI function Enabled.
 * |[1]     |DW16      |EBI Data Width 16-Bit Select
 * |        |          |This bit defines if the EBI data width is 8-bit or 16-bit.
 * |        |          |0 = EBI data width is 8-bit.
 * |        |          |1 = EBI data width is 16-bit.
 * |[2]     |CSPOLINV  |Chip Select Pin Polar Inverse
 * |        |          |This bit defines the active level of EBI chip select pin (EBI_nCS).
 * |        |          |0 = Chip select pin (EBI_nCS) is active low.
 * |        |          |1 = Chip select pin (EBI_nCS) is active high.
 * |[10:8]  |MCLKDIV   |External Output Clock Divider
 * |        |          |The frequency of EBI output clock (MCLK) is controlled by MCLKDIV as follow:
 * |        |          |000 = HCLK/1.
 * |        |          |001 = HCLK/2.
 * |        |          |010 = HCLK/4.
 * |        |          |011 = HCLK/8.
 * |        |          |100 = HCLK/16.
 * |        |          |101 = HCLK/32.
 * |        |          |110 = Reserved.
 * |        |          |111 = Reserved.
 * |[18:16] |TALE      |Extend Time Of ALE
 * |        |          |The EBI_ALE high pulse period (tALE) to latch the address can be controlled by TALE.
 * |        |          |tALE = (TALE+1)*EBI_MCLK.
 * |        |          |Note: This field only available in EBI_CTL0 register
 * |[24]    |WBUFEN    |EBI Write Buffer Enable Bit
 * |        |          |0 = EBI write buffer Disabled.
 * |        |          |1 = EBI write buffer Enabled.
 * |        |          |Note: This bit only available in EBI_CTL0 register
 * @var EBI_T::TCTL1
 * Offset: 0x14  External Bus Interface Bank1 Timing Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:3]   |TACC      |EBI Data Access Time
 * |        |          |TACC define data access time (tACC).
 * |        |          |tACC = (TACC +1) * EBI_MCLK.
 * |[10:8]  |TAHD      |EBI Data Access Hold Time
 * |        |          |TAHD define data access hold time (tAHD).
 * |        |          |tAHD = (TAHD +1) * EBI_MCLK.
 * |[15:12] |W2X       |Idle Cycle After Write
 * |        |          |This field defines the number of W2X idle cycle.
 * |        |          |W2X idle cycle = (W2X * EBI_MCLK).
 * |        |          |When write action is finish, W2X idle cycle is inserted and EBI_nCS return to idle state.
 * |[22]    |RAHDOFF   |Access Hold Time Disable Control When Read
 * |        |          |0 = The Data Access Hold Time (tAHD) during EBI reading is Enabled.
 * |        |          |1 = The Data Access Hold Time (tAHD) during EBI reading is Disabled.
 * |[23]    |WAHDOFF   |Access Hold Time Disable Control When Write
 * |        |          |0 = The Data Access Hold Time (tAHD) during EBI writing is Enabled.
 * |        |          |1 = The Data Access Hold Time (tAHD) during EBI writing is Disabled.
 * |[27:24] |R2R       |Idle Cycle Between Read-To-Read
 * |        |          |This field defines the number of R2R idle cycle.
 * |        |          |R2R idle cycle = (R2R * EBI_MCLK).
 * |        |          |When read action is finish and next action is going to read, R2R idle cycle is inserted and EBI_nCS return to idle state.
 */

