MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M451VE6AE/mcu.h
#define EBI_TCTL1_W2X_Pos                (12)                                              /*!< EBI_T::TCTL1: W2X Position                */
#define EBI_TCTL1_W2X_Msk                (0xful << EBI_TCTL1_W2X_Pos)                      /*!< EBI_T::TCTL1: W2X Mask                    */

#define EBI_TCTL1_RAHDOFF_Pos            (22)                                              /*!< EBI_T::TCTL1: RAHDOFF Position            */
#define EBI_TCTL1_RAHDOFF_Msk            (0x1ul << EBI_TCTL1_RAHDOFF_Pos)                  /*!< EBI_T::TCTL1: RAHDOFF Mask                */

#define EBI_TCTL1_WAHDOFF_Pos            (23)                                              /*!< EBI_T::TCTL1: WAHDOFF Position            */
#define EBI_TCTL1_WAHDOFF_Msk            (0x1ul << EBI_TCTL1_WAHDOFF_Pos)                  /*!< EBI_T::TCTL1: WAHDOFF Mask                */

#define EBI_TCTL1_R2R_Pos                (24)                                              /*!< EBI_T::TCTL1: R2R Position                */
#define EBI_TCTL1_R2R_Msk                (0xful << EBI_TCTL1_R2R_Pos)                      /*!< EBI_T::TCTL1: R2R Mask                    */

/**@}*/ /* EBI_CONST */
/**@}*/ /* end of EBI register group */


/*---------------------- Flash Memory Controller -------------------------*/
/**
    @addtogroup FMC Flash Memory Controller(FMC)
    Memory Mapped Structure for FMC Controller
@{ */


typedef struct
{




/**
 * @var FMC_T::ISPCTL
 * Offset: 0x00  ISP Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ISPEN     |ISP Enable Bit (Write Protect)
 * |        |          |ISP function enable bit. Set this bit to enable ISP function.
 * |        |          |0 = ISP function Disabled.
 * |        |          |1 = ISP function Enabled.
 * |[1]     |BS        |Boot Select (Write Protect)
 * |        |          |When MBS in CONFIG0 is 1, set/clear this bit to select next booting from LDROM/APROM, respectively.
 * |        |          |This bit also functions as chip booting status flag, which can be used to check where chip booted from.
 * |        |          |This bit is initiated with the inverted value of CBS[1] (CONFIG0[7]) after any reset is happened except CPU reset (CPU is 1) or system reset (SYS) is happened.
 * |        |          |0 = Booting from APROM when MBS (CONFIG0[5]) is 1.
 * |        |          |1 = Booting from LDROM when MBS (CONFIG0[5]) is 1.
 * |[3]     |APUEN     |APROM Update Enable Bit (Write Protect)
 * |        |          |0 = APROM cannot be updated when the chip runs in APROM.
 * |        |          |1 = APROM can be updated when the chip runs in APROM.
 * |[4]     |CFGUEN    |CONFIG Update Enable Bit (Write Protect)
 * |        |          |0 = CONFIG cannot be updated.
 * |        |          |1 = CONFIG can be updated.
 * |[5]     |LDUEN     |LDROM Update Enable Bit (Write Protect)
 * |        |          |LDROM update enable bit.
 * |        |          |0 = LDROM cannot be updated.
 * |        |          |1 = LDROM can be updated.
 * |[6]     |ISPFF     |ISP Fail Flag (Write Protect)
 * |        |          |This bit is set by hardware when a triggered ISP meets any of the following conditions:
 * |        |          |This bit needs to be cleared by writing 1 to it.
 * |        |          |(1) APROM writes to itself if APUEN is set to 0.
 * |        |          |(2) LDROM writes to itself if LDUEN is set to 0.
 * |        |          |(3) CONFIG is erased/programmed if CFGUEN is set to 0.
 * |        |          |(4) SPROM is erased/programmed if SPUEN is set to 0
 * |        |          |(5) SPROM is programmed at SPROM secured mode.
 * |        |          |(6) Page Erase command at LOCK mode with ICE connection
 * |        |          |(7) Erase or Program command at brown-out detected
 * |        |          |(8) Destination address is illegal, such as over an available range.
 * |        |          |(9) Invalid ISP commands
 * |[16]    |BL        |Boot Loader Booting (Write Protect)
 * |        |          |This bit is initiated with the inverted value of MBS (CONFIG0[5]).
 * |        |          |Any reset, except CPU reset (CPU is 1) or system reset (SYS), BL will be reloaded.
 * |        |          |This bit is used to check chip boot from Boot Loader or not.
 * |        |          |User should keep original value of this bit when updating FMC_ISPCTL register.
 * |        |          |0 = Booting from APROM or LDROM.
 * |        |          |1 = Booting from Boot Loader.
 * @var FMC_T::ISPADDR
 * Offset: 0x04  ISP Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |ISPADDR   |ISP Address
 * |        |          |The NuMicro M451 series is equipped with embedded flash.
 * |        |          |ISPADDR[1:0] must be kept 00 for ISP 32-bit operation.
 * |        |          |ISPADDR[2:0] must be kept 000 for ISP 64-bit operation.
 * |        |          |For Checksum Calculation command, this field is the flash starting address for checksum calculation, 2 Kbytes alignment is necessary for checksum calculation.
 * @var FMC_T::ISPDAT
 * Offset: 0x08  ISP Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |ISPDAT    |ISP Data
 * |        |          |Write data to this register before ISP program operation.
 * |        |          |Read data from this register after ISP read operation.
 * |        |          |For Run Checksum Calculation command, ISPDAT is the memory size (byte) and 2 Kbytes alignment.
 * |        |          |For ISP Read Checksum command, ISPDAT is the checksum result.
 * |        |          |If ISPDAT = 0x0000_0000, it means that (1) the checksum calculation is in progress, (2) the memory range for checksum calculation is incorrect, or (3) all of data are 0.
 * @var FMC_T::ISPCMD
 * Offset: 0x0C  ISP CMD Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[6:0]   |CMD       |ISP CMD
 * |        |          |ISP command table is shown below:
 * |        |          |0x00= FLASH Read.
 * |        |          |0x04= Read Unique ID.
 * |        |          |0x0B= Read Company ID.
 * |        |          |0x0C= Read Device ID.
 * |        |          |0x0D= Read Checksum.
 * |        |          |0x21= FLASH 32-bit Program.
 * |        |          |0x22= FLASH Page Erase.
 * |        |          |0x27= FLASH Multi-Word Program.
 * |        |          |0x2D= Run Checksum Calculation.
 * |        |          |0x2E= Vector Remap.
 * |        |          |0x61= FLASH 64-bit Program.
 * |        |          |The other commands are invalid.
 * @var FMC_T::ISPTRG
 * Offset: 0x10  ISP Trigger Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ISPGO     |ISP Start Trigger (Write Protect)
 * |        |          |Write 1 to start ISP operation and this bit will be cleared to 0 by hardware automatically when ISP operation is finished.
 * |        |          |0 = ISP operation is finished.
 * |        |          |1 = ISP is progressed.
 * @var FMC_T::DFBA
 * Offset: 0x14  Data Flash Base Address
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |DFBA      |Data Flash Base Address
 * |        |          |This register indicates Data Flash start address. It is a read only register.
 * |        |          |The Data Flash is shared with APROM. the content of this register is loaded from CONFIG1
 * |        |          |This register is valid when DFEN (CONFIG0[0]) =0 .
 * @var FMC_T::FTCTL
 * Offset: 0x18  Flash Access Time Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[6:4]   |FOM       |Frequency Optimization Mode (Write Protect)
 * |        |          |The NuMicro M451 series support adjustable flash access timing to optimize the flash access cycles in different working frequency.
 * |        |          |001 = Frequency <= 12MHz.
 * |        |          |010 = Frequency <= 36MHz.
 * |        |          |100 = Frequency <= 60MHz.
 * |        |          |Others = Frequency <= 72MHz.
 * @var FMC_T::ISPSTS
 * Offset: 0x40  ISP Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ISPBUSY   |ISP Busy Flag (Read Only)
 * |        |          |Write 1 to start ISP operation and this bit will be cleared to 0 by hardware automatically when ISP operation is finished.
 * |        |          |This bit is the mirror of ISPGO(FMC_ISPTRG[0]).
 * |        |          |0 = ISP operation is finished.
 * |        |          |1 = ISP is progressed.
 * |[2:1]   |CBS       |Boot Selection Of CONFIG (Read Only)
 * |        |          |This bit is initiated with the CBS (CONFIG0[7:6]) after any reset is happened except CPU reset (CPU is 1) or system reset (SYS) is happened.
 * |        |          |The following function is valid when MBS (FMC_ISPSTS[3])= 1.
 * |        |          |00 = LDROM with IAP mode.
 * |        |          |01 = LDROM without IAP mode.
 * |        |          |10 = APROM with IAP mode.
 * |        |          |11 = APROM without IAP mode.
 * |[3]     |MBS       |Boot From Boot Loader Selection Flag (Read Only)
 * |        |          |This bit is initiated with the MBS (CONFIG0[5]) after any reset is happened except CPU reset (CPU is 1) or system reset (SYS) is happened
 * |        |          |0 = Booting from Boot Loader.
 * |        |          |1 = Booting
 * |        |          |from LDROM/APROM.(see CBS bit setting)
 * |[5]     |PGFF      |Flash Program With Fast Verification Flag (Read Only)
 * |        |          |This bit is set if data is mismatched at ISP programming verification.
 * |        |          |This bit is clear by performing ISP flash erase or ISP read CID operation.
 * |        |          |0 = Flash Program is success.
 * |        |          |1 = Flash Program is fail. Program data is different with data in the flash memory
 * |[6]     |ISPFF     |ISP Fail Flag (Write Protect)
 * |        |          |This bit is the mirror of ISPFF (FMC_ISPCTL[6]), it needs to be cleared by writing 1 to FMC_ISPCTL[6] or FMC_ISPSTS[6].
 * |        |          |This bit is set by hardware when a triggered ISP meets any of the following conditions:
 * |        |          |(1) APROM writes to itself if APUEN is set to 0.
 * |        |          |(2) LDROM writes to itself if LDUEN is set to 0.
 * |        |          |(3) CONFIG is erased/programmed if CFGUEN is set to 0.
 * |        |          |(4) SPROM is erased/programmed if SPUEN is set to 0
 * |        |          |(5) SPROM is programmed at SPROM secured mode.
 * |        |          |(6) Page Erase command at LOCK mode with ICE connection
 * |        |          |(7) Erase or Program command at brown-out detected
 * |        |          |(8) Destination address is illegal, such as over an available range.
 * |        |          |(9) Invalid ISP commands
 * |[23:9]  |VECMAP    |Vector Page Mapping Address (Read Only)
 * |        |          |All access to 0x0000_0000~0x0000_01FF is remapped to the flash memory address {VECMAP[14:0], 9'h000} ~ {VECMAP[14:0], 9'h1FF}
 * @var FMC_T::MPDAT0
 * Offset: 0x80  ISP Data0 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |ISPDAT0   |ISP Data 0
 * |        |          |This register is the first 32-bit data for 32-bit/64-bit/multi-word programming, and it is also the mirror of FMC_ISPDAT, both registers keep the same data
 * @var FMC_T::MPDAT1
 * Offset: 0x84  ISP Data1 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |ISPDAT1   |ISP Data 1
 * |        |          |This register is the second 32-bit data for 64-bit/multi-word programming.
 * @var FMC_T::MPDAT2
 * Offset: 0x88  ISP Data2 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |ISPDAT2   |ISP Data 2
 * |        |          |This register is the third 32-bit data for multi-word programming.
 * @var FMC_T::MPDAT3
 * Offset: 0x8C  ISP Data3 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |ISPDAT3   |ISP Data 3
 * |        |          |This register is the fourth 32-bit data for multi-word programming.
 * @var FMC_T::MPSTS
 * Offset: 0xC0  ISP Multi-Program Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |MPBUSY    |ISP Multi-Word Program Busy Flag (Read Only)
 * |        |          |Write 1 to start ISP Multi-Word program operation and this bit will be cleared to 0 by hardware automatically when ISP Multi-Word program operation is finished.
 * |        |          |This bit is the mirror of ISPGO(FMC_ISPTRG[0]).
 * |        |          |0 = ISP Multi-Word program operation is finished.
 * |        |          |1 = ISP Multi-Word program operation
 * |        |          |is progressed.
 * |[1]     |PPGO      |ISP Multi-Program Status (Read Only)
 * |        |          |0 = ISP multi-word program operation is not active.
 * |        |          |1 = ISP multi-word program operation is in progress.
 * |[2]     |ISPFF     |ISP Fail Flag (Read Only)
 * |        |          |This bit is the mirror of ISPFF (FMC_ISPCTL[6]), it needs to be cleared by writing 1 to FMC_ISPCTL[6] or FMC_ISPSTS[6].
 * |        |          |This bit is set by hardware when a triggered ISP meets any of the following conditions:
 * |        |          |(1) APROM writes to itself if APUEN is set to 0.
 * |        |          |(2) LDROM writes to itself if LDUEN is set to 0.
 * |        |          |(3) CONFIG is erased/programmed if CFGUEN is set to 0.
 * |        |          |(4) SPROM is erased/programmed if SPUEN is set to 0
 * |        |          |(5) SPROM is programmed at SPROM secured mode.
 * |        |          |(6) Page Erase command at LOCK mode with ICE connection
 * |        |          |(7) Erase or Program command at brown-out detected
 * |        |          |(8) Destination address is illegal, such as over an available range.
 * |        |          |(9) Invalid ISP commands
 * |[4]     |D0        |ISP DATA 0 Flag (Read Only)
 * |        |          |This bit is set when FMC_MPDAT0 is written and auto-clear to 0 when the FMC_MPDAT0 data is programmed to flash complete.
 * |        |          |0 = FMC_MPDAT0 register is empty, or program to flash complete.
 * |        |          |1 = FMC_MPDAT0 register has been written, and not program to flash complete.
 * |[5]     |D1        |ISP DATA 1 Flag (Read Only)
 * |        |          |This bit is set when FMC_MPDAT1 is written and auto-clear to 0 when the FMC_MPDAT1 data is programmed to flash complete.
 * |        |          |0 = FMC_MPDAT1 register is empty, or program to flash complete.
 * |        |          |1 = FMC_MPDAT1 register has been written, and not program to flash complete.
 * |[6]     |D2        |ISP DATA 2 Flag (Read Only)
 * |        |          |This bit is set when FMC_MPDAT2 is written and auto-clear to 0 when the FMC_MPDAT2 data is programmed to flash complete.
 * |        |          |0 = FMC_MPDAT2 register is empty, or program to flash complete.
 * |        |          |1 = FMC_MPDAT2 register has been written, and not program to flash complete.
 * |[7]     |D3        |ISP DATA 3 Flag (Read Only)
 * |        |          |This bit is set when FMC_MPDAT3 is written and auto-clear to 0 when the FMC_MPDAT3 data is programmed to flash complete.
 * |        |          |0 = FMC_MPDAT3 register is empty, or program to flash complete.
 * |        |          |1 = FMC_MPDAT3 register has been written, and not program to flash complete.
 * @var FMC_T::MPADDR
 * Offset: 0xC4  ISP Multi-Program Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |MPADDR    |ISP Multi-Word Program Address
 * |        |          |MPADDR is the address of ISP multi-word program operation when ISPGO flag is 1.
 * |        |          |MPADDR will keep the final ISP address when ISP multi-word program is complete.
    */

    __IO uint32_t ISPCTL;        /* Offset: 0x00  ISP Control Register                                               */
    __IO uint32_t ISPADDR;       /* Offset: 0x04  ISP Address Register                                               */
    __IO uint32_t ISPDAT;        /* Offset: 0x08  ISP Data Register                                                  */
    __IO uint32_t ISPCMD;        /* Offset: 0x0C  ISP CMD Register                                                   */
    __IO uint32_t ISPTRG;        /* Offset: 0x10  ISP Trigger Control Register                                       */
    __I  uint32_t DFBA;          /* Offset: 0x14  Data Flash Base Address                                            */
    __IO uint32_t FTCTL;         /* Offset: 0x18  Flash Access Time Control Register                                 */
    __I  uint32_t RESERVE0[9];  
    __I  uint32_t ISPSTS;        /* Offset: 0x40  ISP Status Register                                                */
    __I  uint32_t RESERVE1[15]; 
    __IO uint32_t MPDAT0;        /* Offset: 0x80  ISP Data0 Register                                                 */
    __IO uint32_t MPDAT1;        /* Offset: 0x84  ISP Data1 Register                                                 */
    __IO uint32_t MPDAT2;        /* Offset: 0x88  ISP Data2 Register                                                 */
    __IO uint32_t MPDAT3;        /* Offset: 0x8C  ISP Data3 Register                                                 */
    __I  uint32_t RESERVE2[12]; 
    __I  uint32_t MPSTS;         /* Offset: 0xC0  ISP Multi-Program Status Register                                  */
    __I  uint32_t MPADDR;        /* Offset: 0xC4  ISP Multi-Program Address Register                                 */

} FMC_T;




/**
    @addtogroup FMC_CONST FMC Bit Field Definition
    Constant Definitions for FMC Controller
@{ */

#define FMC_ISPCTL_ISPEN_Pos             (0)                                               /*!< FMC_T::ISPCTL: ISPEN Position             */
#define FMC_ISPCTL_ISPEN_Msk             (0x1ul << FMC_ISPCTL_ISPEN_Pos)                   /*!< FMC_T::ISPCTL: ISPEN Mask                 */

#define FMC_ISPCTL_BS_Pos                (1)                                               /*!< FMC_T::ISPCTL: BS Position                */
#define FMC_ISPCTL_BS_Msk                (0x1ul << FMC_ISPCTL_BS_Pos)                      /*!< FMC_T::ISPCTL: BS Mask                    */

#define FMC_ISPCTL_APUEN_Pos             (3)                                               /*!< FMC_T::ISPCTL: APUEN Position             */
#define FMC_ISPCTL_APUEN_Msk             (0x1ul << FMC_ISPCTL_APUEN_Pos)                   /*!< FMC_T::ISPCTL: APUEN Mask                 */

