MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/M451VE6AE/mcu.h
    __IO uint32_t CTL;           /* Offset: 0x00/0x10/0x20/0x30/0x40/0x50/0x60/0x70/0x80/0x90/0xA0/0xB0  Descriptor Table Control Register of PDMA Channel 0~11 */
    __IO uint32_t SA;            /* Offset: 0x04/0x14/0x24/0x34/0x44/0x54/0x64/0x74/0x84/0x94/0xA4/0xB4  Source Address Register of PDMA Channel 0~11 */
    __IO uint32_t DA;            /* Offset: 0x08/0x18/0x28/0x38/0x48/0x58/0x68/0x78/0x88/0x98/0xA8/0xB8  Destination Address Register of PDMA Channel 0~11 */
    __IO uint32_t NEXT;          /* Offset: 0x0C/0x1C/0x2C/0x3C/0x4C/0x5C/0x6C/0x7C/0x8C/0x9C/0xAC/0xBC  First Scatter-Gather Descriptor Table Offset Address of PDMA Channel 0~11 */

} DSCT_T;




typedef struct
{


/**
 * @var PDMA_T::DSCT
 * Offset: 0x0000 ~ 0x00BC  DMA Embedded Description Table 0~11
 * ---------------------------------------------------------------------------------------------------
 * @var PDMA_T::CURSCAT
 * Offset: 0xC0 ~ 0xEC Current Scatter-Gather Descriptor Table Address of PDMA Channel 0~11
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |CURADDR   |PDMA Current Description Address Register (Read Only)
 * |        |          |This field indicates a 32-bit current external description address of PDMA controller.
 * |        |          |Note: This field is read only and only used for Scatter-Gather mode to indicate the current external description address.
 * @var PDMA_T::CHCTL
 * Offset: 0x400  PDMA Channel Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |CHENn     |PDMA Channel Enable Bit
 * |        |          |Set this bit to 1 to enable PDMAn operation.
 * |        |          |If each channel is not set as enabled, each channel cannot be active.
 * |        |          |0 = PDMA channel [n] Disabled.
 * |        |          |1 = PDMA channel [n] Enabled.
 * |        |          |Note1: If software stops each PDMA transfer by setting PDMA_STOP register, this bit will be cleared automatically after finishing current transfer.
 * |        |          |Note2: Software reset (writing 0xFFFF_FFFF to PDMA_STOP register) will also clear this bit.
 * @var PDMA_T::STOP
 * Offset: 0x404  PDMA Transfer Stop Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |STOPn     |PDMA Transfer Stop Control Register (Write Only)
 * |        |          |User can stop the PDMA transfer by STOPn bit field or by software reset (writing '0xFFFF_FFFF' to PDMA_STOP register).
 * |        |          |By bit field:
 * |        |          |0 = No effect.
 * |        |          |1 = Stop PDMA transfer[n].
 * |        |          |When software set PDMA_STOP bit, the operation will finish the on-going transfer channel and then clear the channel enable bit (PDMA_CHCTL [CHEN]) and request active flag.
 * |        |          |By write 0xFFFF_FFFF to PDMA_STOP:
 * |        |          |Setting all PDMA_STOP bit to "1" will generate software reset to reset internal state machine (the DSCT will not be reset).
 * |        |          |When software reset, the operation will be stopped imminently that include the on-going transfer and the channel enable bit (PDMA_CHCTL [CHEN]) and request active flag will be cleared to '0'.
 * |        |          |Note: User can poll channel enable bit to know if the on-going transfer is finished.
 * @var PDMA_T::SWREQ
 * Offset: 0x408  PDMA Software Request Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |SWREQn    |PDMA Software Request Register (Write Only)
 * |        |          |Set this bit to 1 to generate a software request to PDMA [n].
 * |        |          |0 = No effect.
 * |        |          |1 = Generate a software request.
 * |        |          |Note1: User can read PDMA_TRGSTS register to know which channel is on active.
 * |        |          |Active flag may be triggered by software request or peripheral request.
 * |        |          |Note2: If user does not enable each PDMA channel, the software request will be ignored.
 * @var PDMA_T::TRGSTS
 * Offset: 0x40C  PDMA Channel Request Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |REQSTSn   |PDMA Channel Request Status (Read Only)
 * |        |          |This flag indicates whether channel[n] have a request or not, no matter request from software or peripheral.
 * |        |          |When PDMA controller finishes channel transfer, this bit will be cleared automatically.
 * |        |          |0 = PDMA Channel n has no request.
 * |        |          |1 = PDMA Channel n has a request.
 * |        |          |Note1: If software stops each PDMA transfer by setting PDMA_STOP register, this bit will be cleared automatically after finishing current transfer.
 * |        |          |Note2: Software reset (writing 0xFFFF_FFFF to PDMA_STOP register) will also clear this bit.
 * @var PDMA_T::PRISET
 * Offset: 0x410  PDMA Fixed Priority Setting Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |FPRISETn  |PDMA Fixed Priority Setting Register
 * |        |          |Set this bit to 1 to enable fixed priority level.
 * |        |          |Write Operation:
 * |        |          |0 = No effect.
 * |        |          |1 = Set PDMA channel [n] to fixed priority channel.
 * |        |          |Read Operation:
 * |        |          |0 = Corresponding PDMA channel is round-robin priority.
 * |        |          |1 = Corresponding PDMA channel is fixed priority.
 * |        |          |Note: This field only set to fixed priority, clear fixed priority use PDMA_PRICLR register.
 * @var PDMA_T::PRICLR
 * Offset: 0x414  PDMA Fixed Priority Clear Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |FPRICLRn  |PDMA Fixed Priority Clear Register (Write Only)
 * |        |          |Set this bit to 1 to clear fixed priority level.
 * |        |          |0 = No effect.
 * |        |          |1 = Clear PDMA channel [n] fixed priority setting.
 * |        |          |Note: User can read PDMA_PRISET register to know the channel priority.
 * @var PDMA_T::INTEN
 * Offset: 0x418  PDMA Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |INTENn    |PDMA Interrupt Enable Register
 * |        |          |This field is used for enabling PDMA channel[n] interrupt.
 * |        |          |0 = PDMA channel n interrupt Disabled.
 * |        |          |1 = PDMA channel n interrupt Enabled.
 * |[31:12] |Reserved  |should be keep 0.
 * @var PDMA_T::INTSTS
 * Offset: 0x41C  PDMA Interrupt Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |ABTIF     |PDMA Read/Write Target Abort Interrupt Flag (Read-Only)
 * |        |          |This bit indicates that PDMA has target abort error; Software can read PDMA_ABTSTS register to find which channel has target abort error.
 * |        |          |0 = No AHB bus ERROR response received.
 * |        |          |1 = AHB bus ERROR response received.
 * |[1]     |TDIF      |Transfer Done Interrupt Flag (Read Only)
 * |        |          |This bit indicates that PDMA controller has finished transmission; User can read PDMA_TDSTS register to indicate which channel finished transfer.
 * |        |          |0 = Not finished yet.
 * |        |          |1 = PDMA channel has finished transmission.
 * |[2]     |TEIF      |Table Empty Interrupt Flag (Read Only)
 * |        |          |This bit indicates that PDMA controller has finished each table transmission and the operation is Stop mode.
 * |        |          |User can read TEIF register to indicate which channel finished transfer.
 * |        |          |0 = PDMA channel transfer is not finished.
 * |        |          |1 = PDMA channel transfer is finished and the operation is in idle state.
 * |[8:15]  |REQTOFn   |Request Time-out Flag For Each Channel [N](M45xD/M45xC Only)
 * |        |          |This flag indicates that PDMA controller has waited peripheral request for a period defined by PDMA_TOCn, user can write 1 to clear these bits.
 * |        |          |0 = No request time-out.
 * |        |          |1 = Peripheral request time-out.
 * @var PDMA_T::ABTSTS
 * Offset: 0x420  PDMA Channel Read/Write Target Abort Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |ABTIFn    |PDMA Read/Write Target Abort Interrupt Status Flag
 * |        |          |This bit indicates which PDMA controller has target abort error; User can write 1 to clear these bits.
 * |        |          |0 = No AHB bus ERROR response received when channel n transfer.
 * |        |          |1 = AHB bus ERROR response received when channel n transfer.
 * @var PDMA_T::TDSTS
 * Offset: 0x424  PDMA Channel Transfer Done Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |TDIFn     |Transfer Done Flag Register
 * |        |          |This bit indicates whether PDMA controller channel transfer has been finished or not, user can write 1 to clear these bits.
 * |        |          |0 = PDMA channel transfer has not finished.
 * |        |          |1 = PDMA channel has finished transmission.
 * @var PDMA_T::SCATSTS
 * Offset: 0x428  PDMA Scatter-Gather Table Empty Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |TEMPTYFn  |Scatter-Gather Table Empty Flag Register
 * |        |          |This bit indicates which PDMA channel n Scatter Gather table is empty when SWREQn set to high or channel has finished transmission and the operation mode is Stop mode.
 * |        |          |User can write 1 to clear these bits.
 * |        |          |0 = PDMA channel scatter-gather table is not empty.
 * |        |          |1 = PDMA channel scatter-gather table is empty and PDMA SWREQ has be set.
 * @var PDMA_T::TACTSTS
 * Offset: 0x42C  PDMA Transfer Active Flag Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:0]  |TXACTFn   |Transfer On Active Flag Register (Read Only)
 * |        |          |This bit indicates which PDMA channel is in active.
 * |        |          |0 = PDMA channel is not finished.
 * |        |          |1 = PDMA channel is active.
 * @var PDMA_T::TOUTEN
 * Offset: 0x434  PDMA Time-out Enable register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TOUTENn   |PDMA Time-Out Enable Bits
 * |        |          |0 = PDMA Channel n time-out function Disable.
 * |        |          |1 = PDMA Channel n time-out function Enable.
 * @var PDMA_T::TOUTIEN
 * Offset: 0x438  PDMA Time-out Interrupt Enable register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |TOUTIENn  |PDMA Time-Out Interrupt Enable Bits
 * |        |          |0 = PDMA Channel n time-out interrupt Disable.
 * |        |          |1 = PDMA Channel n time-out interrupt Enable.
 * @var PDMA_T::SCATBA
 * Offset: 0x43C  PDMA Scatter-Gather Descriptor Table Base Address Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:16] |SCATBA    |PDMA Scatter-Gather Descriptor Table Address Register
 * |        |          |In Scatter-Gather mode, this is the base address for calculating the next link - list address.
 * |        |          |The next link address equation is.
 * |        |          |Next Link Address = PDMA_SCATBA + PDMA_DSCT_NEXT.
 * |        |          |Note: Only useful in Scatter-Gather mode.
 * @var PDMA_T::TOC0_1
 * Offset: 0x440  PDMA Time-out Counter Ch1 and Ch0 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:16] |TOC1      |Time-Out Counter For Channel 1
 * |        |          |This controls the period of time-out function for channel 1. The calculation unit is based on 10 kHz clock.
 * |[15:0]  |TOC0      |Time-Out Counter For Channel 0
 * |        |          |This controls the period of time-out function for channel 0. The calculation unit is based on 10 kHz clock.
 * @var PDMA_T::TOC2_3
 * Offset: 0x444  PDMA Time-out Counter Ch3 and Ch2 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:16] |TOC3      |Time-Out Counter For Channel 3
 * |        |          |This controls the period of time-out function for channel 3. The calculation unit is based on 10 kHz clock.
 * |[15:0]  |TOC2      |Time-Out Counter For Channel 2
 * |        |          |This controls the period of time-out function for channel 2. The calculation unit is based on 10 kHz clock.
 * @var PDMA_T::TOC4_5
 * Offset: 0x448  PDMA Time-out Counter Ch5 and Ch4 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:16] |TOC5      |Time-Out Counter For Channel 5
 * |        |          |This controls the period of time-out function for channel 5. The calculation unit is based on 10 kHz clock.
 * |[15:0]  |TOC4      |Time-Out Counter For Channel 4
 * |        |          |This controls the period of time-out function for channel 4. The calculation unit is based on 10 kHz clock.
 * @var PDMA_T::TOC6_7
 * Offset: 0x44C  PDMA Time-out Counter Ch7 and Ch6 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:16] |TOC7      |Time-Out Counter For Channel 7
 * |        |          |This controls the period of time-out function for channel 7. The calculation unit is based on 10 kHz clock.
 * |[15:0]  |TOC6      |Time-Out Counter For Channel 6
 * |        |          |This controls the period of time-out function for channel 6. The calculation unit is based on 10 kHz clock.
 * @var PDMA_T::REQSEL0_3
 * Offset: 0x480  PDMA Request Source Select Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:0]   |REQSRC0   |Channel 0 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 0.
 * |        |          |User can configure the peripheral by setting REQSRC0.
 * |        |          |1 = Channel connects to SPI0_TX.
 * |        |          |2 = Channel connects to SPI1_TX.
 * |        |          |3 = Channel connects to SPI2_TX.
 * |        |          |4 = Channel connects to UART0_TX.
 * |        |          |5 = Channel connects to UART1_TX.
 * |        |          |6 = Channel connects to UART2_TX.
 * |        |          |7 = Channel connects to UART3_TX.
 * |        |          |8 = Channel connects to DAC_TX.
 * |        |          |9 = Channel connects to ADC_RX.
 * |        |          |11 = Channel connects to PWM0_P1_RX.
 * |        |          |12 = Channel connects to PWM0_P2_RX.
 * |        |          |13 = Channel connects to PWM0_P3_RX.
 * |        |          |14 = Channel connects to PWM1_P1_RX.
 * |        |          |15 = Channel connects to PWM1_P2_RX.
 * |        |          |16 = Channel connects to PWM1_P3_RX.
 * |        |          |17 = Channel connects to SPI0_RX.
 * |        |          |18 = Channel connects to SPI1_RX.
 * |        |          |19 = Channel connects to SPI2_RX.
 * |        |          |20 = Channel connects to UART0_RX.
 * |        |          |21 = Channel connects to UART1_RX.
 * |        |          |22 = Channel connects to UART2_RX.
 * |        |          |23 = Channel connects to UART3_RX.
 * |        |          |31 = Disable PDMA.
 * |        |          |Others = Reserved.
 * |        |          |Note 1: A peripheral can't assign to two channels at the same time.
 * |        |          |Note 2: This field is useless when transfer between memory and memory.
 * |[12:8]  |REQSRC1   |Channel 1 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 1.
 * |        |          |User can configure the peripheral setting by REQSRC1.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[20:16] |REQSRC2   |Channel 2 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 2.
 * |        |          |User can configure the peripheral setting by REQSRC2.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[28:24] |REQSRC3   |Channel 3 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 3.
 * |        |          |User can configure the peripheral setting by REQSRC3.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * @var PDMA_T::REQSEL4_7
 * Offset: 0x484  PDMA Request Source Select Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:0]   |REQSRC4   |Channel 4 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 4.
 * |        |          |User can configure the peripheral setting by REQSRC4.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[12:8]  |REQSRC5   |Channel 5 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 5.
 * |        |          |User can configure the peripheral setting by REQSRC5.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[20:16] |REQSRC6   |Channel 6 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 6.
 * |        |          |User can configure the peripheral setting by REQSRC6.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[28:24] |REQSRC7   |Channel 7 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 7.
 * |        |          |User can configure the peripheral setting by REQSRC7.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * @var PDMA_T::REQSEL8_11
 * Offset: 0x488  PDMA Request Source Select Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[4:0]   |REQSRC8   |Channel 8 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 8.
 * |        |          |User can configure the peripheral setting by REQSRC8.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[12:8]  |REQSRC9   |Channel 9 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 9.
 * |        |          |User can configure the peripheral setting by REQSRC9.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[20:16] |REQSRC10  |Channel 10 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 10.
 * |        |          |User can configure the peripheral setting by REQSRC10.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 * |[28:24] |REQSRC11  |Channel 11 Request Source Selection
 * |        |          |This filed defines which peripheral is connected to PDMA channel 11.
 * |        |          |User can configure the peripheral setting by REQSRC11.
 * |        |          |Note: The channel configuration is the same as REQSRC0 field.
 * |        |          |Please refer to the explanation of REQSRC0.
 */
    
